"Job Log" = "Registro de trabajos";
"Job Log2" = "Registro de trabajos";

"User ID" = "ID Usuario";
"User ID:" = "ID Usuario:";

"Job Type" = "Tipo de trabajo";
"Job Type:" = "Tipo de trabajo:";

"File Name" = "Nombre de archivo";
"File Name:" = "Nombre de archivo:";

"Password" = "Contraseña";
"Password:" = "Contraseña:";

"User Code" = "Código usuario";
"User Code:" = "Código usuario:";

"Time" = "Hora";
"Time:" = "Hora:";

"Enable User Code" = "Activar código de usuario";
"Pop up Every Time" = "Mostrar siempre";
"User Code Always Blank" = "Código de usuario siempre en blanco";
"OK" = "Aceptar";
"Cancel" = "Cancelar";
"Enable Specify Time" = "Establecer hora impr.";

"Folder Number" = "Número de la carpeta";
"Folder Number:" = "Número de la carpeta:";

"Folder Password" = "Contraseña de la carpeta";
"Folder Password:" = "Contraseña de la carpeta:";

"Normal Print" = "Impresión normal";
"Sample Print" = "Impresión de muestra";
"Locked Print" = "Impresión bloqueada";
"Hold Print" = "Impresión retenida";
"Stored Print" = "Impresión almacenada";
"Store and Print" = "Almacenar e imprimir";
"Document Server" = "Document Server";

"(4-8 digits)" = "(4-8 dígitos.)";

"Enter a valid File Name" = "Introduzca un nombre de archivo válido.";
"Enter a valid Password" = "Introduzca una contraseña válida.";
"Enter a valid User Code" = "Introduzca un código de usuario válido.";
"Enter a valid User ID" = "Introduzca un ID de usuario válido.";
"Enter a valid Folder Password" = "Introduzca una contraseña de carpeta válida.";

"(Up to 8 alphanumeric characters)" = "(Hasta 8 caracteres alfanuméricos.)";
"(Up to 16 alphanumeric characters)" = "(Hasta 16 caracteres alfanuméricos.)";
"(4 digits)" = "(4-8 dígitos.)";
"(Up to 8 digits)" = "(4-8 dígitos.)";